# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas

import numpy as np

import pandas as pd

from scipy import stats


from statsmodels.stats.proportion import proportions_ztest

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [2]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:

salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [4]:
# Your code here:

salaries.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [5]:
# Your code here:

# salaries[["Typical Hours", "Annual Salary"]].head().sort_values(by="Typical Hours", na_position='last').head()

salaries[["Name", "Salary or Hourly"]].groupby("Salary or Hourly").count().head()

                   Name
Salary or Hourly
Hourly             8022
Salary            25161

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [6]:
# Your code here:

salaries[["Name", "Department"]].groupby("Department").count().head()

                   Name
Department
ADMIN HEARNG         39
ANIMAL CONTRL        81
AVIATION           1629
BOARD OF ELECTION   107
BOARD OF ETHICS       8

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [7]:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

In [8]:
# Your code here:

# Hipótesis nula: El salario/hora de los trabajadores es igual a 30$/hora.

# Comparación de la desviación existente entre la media dada y la media de la muestra de observaciones independientes obtenida.

dfSalary  = salaries[salaries["Salary or Hourly"]=="Hourly"]["Hourly Rate"]

dfSalary.head()

stats.ttest_1samp(dfSalary,popmean=30)

Ttest_1sampResult(statistic=20.6198057854942, pvalue=4.3230240486229894e-92)

Rechazamos la hipótesis nula, es decir, no podemos afirmar que el salario/hora de los trabajadores sea igual a 30$

Esto se debe a que la media de dicha muestra comparada con la supuesta media otorgada de la población no son iguales, y presentan una desviación de casi dos puntos entre sí.

In [26]:
#Test de prueba para verificar la diferencia entre medias anterior

salaries[salaries["Salary or Hourly"]=="Hourly"]["Hourly Rate"].mean()

32.78855771628024

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [9]:
# Your code here:

# Hipótesis nula: Los salarios de policia de este año son iguales que los del año pasado de 86.000$

# Hipótesis alternativa: Los salarios de policia de este año son mayores que los del año pasado de 86.000$

df2  = salaries[salaries["Department"]=="POLICE"]["Annual Salary"].dropna()

df2.head()

0     101442.0
1      94122.0
9      93354.0
11     84054.0
12     87006.0
Name: Annual Salary, dtype: float64

In [27]:

stats.ttest_1samp(df2,86000)

Ttest_1sampResult(statistic=3.081997005712994, pvalue=0.0020603403550965137)

Rechazamos la hipótesis nula porque el estadístico p-valor obtenido es inferior al nivel de significación de 0,025 (0,05/2) al 95% de confianza.

De este modo, se contempla la hipótesis alternativa de que los salarios de este año son mayores que los del año pasado, porque la media de la muestra no es igual a 86.000$ y el "statistic" afirma que dicha cifra se situa a la izquierda de la media de la muestra.

In [11]:
#Test de prueba para verificar la diferencia entre medias anterior

salaries[salaries["Salary or Hourly"]=="Hourly"]["Hourly Rate"].mean()

df2.mean()

86486.41450313339

Using the `crosstab` function, find the department that has the most hourly workers.

In [13]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

In [14]:
df5 = pd.crosstab(salaries["Department"], salaries["Salary or Hourly"]).sort_values(by='Hourly',ascending=False)

df5

Salary or Hourly       Hourly  Salary
Department
STREETS & SAN            1862     336
WATER MGMNT              1513     366
OEMC                     1273     829
AVIATION                 1082     547
GENERAL SERVICES          765     215
TRANSPORTN                725     415
PUBLIC LIBRARY            299     716
FAMILY & SUPPORT          287     328
CITY COUNCIL               64     347
FINANCE                    44     516
LAW                        40     367
ANIMAL CONTRL              19      62
POLICE                     10   13404
MAYOR'S OFFICE              8      77
BUSINESS AFFAIRS            7     164
CULTURAL AFFAIRS            7      58
COMMUNITY DEVELOPMENT       4     203
HUMAN RESOURCES             4      75
HEALTH                      3     485
PROCUREMENT                 2      90
FIRE                        2    4639
BUDGET & MGMT               2      44
HUMAN RELATIONS             0      16
INSPECTOR GEN               0      87
DoIT                        0      99
LICENSE APPL COMM           0       1
DISABILITIES                0      28
COPA                        0     116
CITY CLERK                  0      84
POLICE BOARD                0       2
BUILDINGS                   0     269
BOARD OF ETHICS             0       8
BOARD OF ELECTION           0     107
TREASURER                   0      22
ADMIN HEARNG                0      39

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [28]:
# Your code here:

df6 = salaries[salaries["Department"] =="STREETS & SAN"]["Hourly Rate"].dropna()

df6.head()

7     35.60
21    21.43
24    35.60
36    36.21
39    35.60
Name: Hourly Rate, dtype: float64

In [29]:
# H0: El salario medio de los trabajadores del departamento con más trabajadores por horas es igual a 35$/hora

# H1: El salario medio de los trabajadores del departamento con más trabajadores por horas es menor a 35$/hora


stats.ttest_1samp(df6,35)

Ttest_1sampResult(statistic=-9.567447887848152, pvalue=3.3378530564707717e-21)

p-valor < 0,025

Rechazamos la hipótesis nula y abrazamos la hipótesis alternativa

En otras palabras, el salario medio de los trabajadores no es igual a 36$ y se sitúa a la derecha atendiendo al "statistic"

In [30]:
#Test de prueba para verificar la diferencia entre medias anterior

df6.mean()

33.72837808807734

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [31]:
# Your code here:

df6 = salaries["Hourly Rate"].dropna()

df6.head

<bound method NDFrame.head of 4        19.86
6        46.10
7        35.60
10        2.65
18       17.68
         ...
33164    46.10
33168    17.68
33169    35.60
33174    46.35
33175    48.85
Name: Hourly Rate, Length: 8022, dtype: float64>

In [32]:
intervalo = stats.t.interval(0.95, len(df6)-1, loc=np.mean(df6), scale=stats.sem(df6))

intervalo

(32.52345834488425, 33.05365708767623)

In [33]:
df6.mean()

32.78855771628024

La media de la columna se sitúa en mitad del intervalo de confianza generado, confirmando que el intervalo generado es correcto.

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [34]:
# Your code here:

df7 = salaries[(salaries["Department"]=="POLICE")]

df7 = df7[(df7["Annual Salary"].notna())]

df7.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN

In [35]:
intervalo = stats.t.interval(0.95, len(df7["Annual Salary"])-1, loc=np.mean(df7["Annual Salary"]), scale=stats.sem(df7["Annual Salary"]))

intervalo

(86177.05631531784, 86795.77269094894)

In [36]:
np.mean(df7["Annual Salary"])

86486.41450313339

In [ ]:
La media de la columna se sitúa en mitad del intervalo de confianza generado, confirmando que el intervalo generado es correcto.

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [ ]:

H0: p = 25% 

H1: p != 25%

In [42]:
df8 = salaries[(salaries["Salary or Hourly"]=="Hourly")]

df8.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68

In [46]:
count = len(df8["Salary or Hourly"])
nobs = len(salaries["Salary or Hourly"])
value = 0.25

proportions_ztest(count, nobs, value)

(-3.5099964213703005, 0.0004481127249057967)

p-valor < 0,05

Rechazamos H0